beepnl/beep-base-firmware/Source_V1.5.12/Code/nRF/nRF5_SDK_15.3/components/ble/ble_services/ble_beep/ble_beep.c

#include "ble_beep.h"
#include <string.h>
#include "nordic_common.h"
#include "ble.h"
#include "ble_err.h"
#include "ble_srv_common.h"
#include "app_util.h"
#include "ble_setup.h"
#include "nrf_queue.h"

#define NRF_LOG_MODULE_NAME BEEP_SERVICE
#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();

#define MAX_CSCM_LEN  (BLE_GATT_ATT_MTU_DEFAULT - OPCODE_LENGTH - HANDLE_LENGTH)    /**< Maximum size of a transmitted Cycling Speed and Cadence Measurement. */

#define BLE_BUS_LOG_ENABLED 1


NRF_QUEUE_DEF(beepQue_s, beep_queue, BEEP_QUEUE_LENGHT, NRF_QUEUE_MODE_NO_OVERFLOW);

// Queue function prototypes.
uint32_t ble_beep_controlPoint_addQueue(ble_beep_t * p_beep, BEEP_protocol_s * prot);

/**@brief check if the cccd is configured
 *
 * @param[in]   p_sc_ctrlpt      SC Ctrlpt structure.
 * @return  true if the sc_control point's cccd is correctly configured, false otherwise.
 */
static bool is_cccd_configured(uint16_t conn_handle, uint16_t cccd_handle)
{
    uint32_t err_code;
    uint8_t  cccd_value_buf[BLE_CCCD_VALUE_LEN];
    bool     is_sccp_indic_enabled = false;
    ble_gatts_value_t gatts_value;

    // Initialize value struct.
    memset(&gatts_value, 0, sizeof(gatts_value));

    gatts_value.len     = BLE_CCCD_VALUE_LEN;
    gatts_value.offset  = 0;
    gatts_value.p_value = cccd_value_buf;

    err_code = sd_ble_gatts_value_get(conn_handle, cccd_handle, &gatts_value);
    if (err_code != NRF_SUCCESS)
    {

    }

    is_sccp_indic_enabled = ble_srv_is_indication_enabled(cccd_value_buf);

    return is_sccp_indic_enabled;
}


static uint16_t read_cccd(uint16_t conn_handle, uint16_t cccd_handle)
{
    uint32_t err_code;
    uint8_t  cccd_value_buf[BLE_CCCD_VALUE_LEN];
    bool     is_sccp_indic_enabled = false;
    ble_gatts_value_t gatts_value;

    // Initialize value struct.
    memset(&gatts_value, 0, sizeof(gatts_value));

    gatts_value.len     = BLE_CCCD_VALUE_LEN;
    gatts_value.offset  = 0;
    gatts_value.p_value = cccd_value_buf;

    err_code = sd_ble_gatts_value_get(conn_handle, cccd_handle, &gatts_value);
    if (err_code != NRF_SUCCESS)
    {
        return 0;
    }

    uint16_t cccd_value = uint16_decode(cccd_value_buf);

    return cccd_value;
}


bool beep_read_txNotificationState(ble_beep_t * p_beep)
{
    uint16_t cccdState = read_cccd(p_beep->conn_handle, p_beep->tx_handles.cccd_handle);
    const bool indicationEnabled = ((cccdState & BLE_GATT_HVX_NOTIFICATION) != 0);
    NRF_LOG_INFO("Beep TX state %u/0x%04X, indication: %s", cccdState, cccdState, (indicationEnabled ? "On" : "Off"));
    return indicationEnabled;
}





/**@brief sends a control point indication.
 *
 * @param[in]   p_sc_ctrlpt      SC Ctrlpt structure.
 */
static uint32_t beep_ctrlpt_send(ble_beep_t * p_beep)
{
    uint16_t               hvx_len;
    ble_gatts_hvx_params_t hvx_params;
    uint32_t               err_code = NRF_SUCCESS;

    while(!nrf_queue_is_empty(&beep_queue))
    {

        // Retrtieve data from the queue
        beepQue_s get;
        memset(&get, 0, sizeof(beepQue_s));
        err_code = nrf_queue_generic_pop(&beep_queue, &get, true);       // Just peek
        if(err_code != NRF_SUCCESS)
        {
            return err_code;
        }

        hvx_len = get.lenght;
        memset(&hvx_params, 0, sizeof(hvx_params));

        hvx_params.handle = p_beep->control_char.value_handle;
        hvx_params.type   = BLE_GATT_HVX_INDICATION;
        hvx_params.offset = 0;
        hvx_params.p_len  = &hvx_len;
        hvx_params.p_data = get.buff; //reponse;

        err_code = sd_ble_gatts_hvx(p_beep->conn_handle, &hvx_params);
        uint32_t queLenght = (uint32_t) nrf_queue_utilization_get(&beep_queue);
        #if 1
            NRF_LOG_INFO("Beep HVX: 0x%04X. queSize: %u", err_code, queLenght);
        #endif

        switch (err_code)
        {
            case NRF_SUCCESS:
                err_code = nrf_queue_generic_pop(&beep_queue, &get, false);       // Pop the previously peeked data.
                // Loop again if there' data in the Que
                break;

            default:
                return err_code;
                break;
        }
    }
	return err_code;
}

uint32_t beep_ctrlpt_send_error(ble_beep_t * p_beep, BEEP_CID cmd, uint32_t error)
{
    uint32_t ret = NRF_SUCCESS;
	BEEP_protocol_s encode;
    memset(&encode, 0, sizeof(BEEP_protocol_s));

	encode.command					= RESPONSE;
	encode.param.error.ErrorCmd		= cmd;
    encode.param.error.errorCode	= error;

    // Clear the buffer.
	ret = ble_beep_controlPoint_addQueue(p_beep, &encode);
	ret = beep_ctrlpt_send(p_beep);
    return ret;
}


#define SC_CTRLPT_NACK_PROC_ALREADY_IN_PROGRESS   (BLE_GATT_STATUS_ATTERR_APP_BEGIN + 0)
#define SC_CTRLPT_NACK_CCCD_IMPROPERLY_CONFIGURED (BLE_GATT_STATUS_ATTERR_APP_BEGIN + 1)

/**@brief Handle a write event to the Speed and Cadence Control Point.
 *
 * @param[in]   p_beep      SC Ctrlpt structure.
 * @param[in]   p_evt_write      WRITE event to be handled.
 */
static void on_ctrlpt_write(ble_beep_t * p_beep, ble_gatts_evt_write_t const * p_evt_write)
{
	uint8_t									offset = 0;
    uint32_t								err_code;
    ble_gatts_rw_authorize_reply_params_t	auth_reply;

    auth_reply.type                     = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
    auth_reply.params.write.offset      = 0;
    auth_reply.params.write.len         = 0;
    auth_reply.params.write.p_data      = NULL;
    auth_reply.params.write.gatt_status = BLE_GATT_STATUS_SUCCESS;
    auth_reply.params.write.update      = 1;

    if (is_cccd_configured(p_beep->conn_handle, p_beep->control_char.cccd_handle))
    {
        auth_reply.params.write.gatt_status = BLE_GATT_STATUS_SUCCESS;
    }
    else
    {
        auth_reply.params.write.gatt_status = SC_CTRLPT_NACK_CCCD_IMPROPERLY_CONFIGURED;
    }

    err_code = sd_ble_gatts_rw_authorize_reply(p_beep->conn_handle, &auth_reply);
    if (err_code != NRF_SUCCESS)
    {

    }

    if (auth_reply.params.write.gatt_status != BLE_GATT_STATUS_SUCCESS)
    {
        return;
    }

	NRF_LOG_INFO("BLE control point lenght: %u", p_evt_write->len);
	NRF_LOG_HEXDUMP_INFO(p_evt_write->data, p_evt_write->len);

	// Decode the message received
    BEEP_protocol_s decode;
   
    err_code = beep_protocol_decode(&decode, (uint8_t *)p_evt_write->data, p_evt_write->len, &offset);
    if(err_code != NRF_SUCCESS)
    {
		beep_ctrlpt_send_error(p_beep, decode.command, err_code);
    }
    else
    {
		// Call the callback
		if(p_beep->callback_p != NULL)
		{
            decode.source = BLE_SOURCE;
			p_beep->callback_p(BLE_SOURCE, &decode);
		}
	}
}




