beepnl/beep-base-firmware/Source_V1.5.12/Code/nRF/nRF5_SDK_15.3/components/ble/ble_services/ble_beep/ble_beep.c
/**@brief Function for handling the Connect event.
 *
 * @param[in]   p_beep      Cycling Speed and Cadence Service structure.
 * @param[in]   p_ble_evt   Event received from the BLE stack.
 */
static void on_connect(ble_beep_t * p_beep, ble_evt_t const * p_ble_evt)
{
    p_beep->conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
    p_beep->isTX_notification_enabled = beep_read_txNotificationState(p_beep);
    p_beep->txEventHandler(APP_FLASH_COMM_CONNECTED, NULL);
    nrf_queue_reset(&beep_queue);
}


/**@brief Function for handling the Disconnect event.
 *
 * @param[in]   p_beep      Cycling Speed and Cadence Service structure.
 * @param[in]   p_ble_evt   Event received from the BLE stack.
 */
static void on_disconnect(ble_beep_t * p_beep, ble_evt_t const * p_ble_evt)
{
    UNUSED_PARAMETER(p_ble_evt);
    p_beep->conn_handle = BLE_CONN_HANDLE_INVALID;
    p_beep->isRX_notification_enabled    = false;
    p_beep->isTX_notification_enabled    = false;
    p_beep->txLenght                     = 0;
    p_beep->txMsgLenght                  = 0;
    p_beep->packetCounter                = 0;
    p_beep->mtuDatalenght = NRF_SDH_BLE_GATT_MAX_MTU_SIZE;
    p_beep->dataLenghtMax = BLE_NUS_MAX_DATA_LEN;
    p_beep->txEventHandler(APP_FLASH_COMM_DISCONNECTED, NULL);
    nrf_queue_reset(&beep_queue);
}


/**@brief Function for handling write events to the beep Measurement characteristic.
 *
 * @param[in]   p_beep        Cycling Speed and Cadence Service structure.
 * @param[in]   p_evt_write   Write event received from the BLE stack.
 */
static void on_meas_cccd_write(ble_beep_t * p_beep, ble_gatts_evt_write_t const * p_evt_write)
{
    if (p_evt_write->len == 2)
    {
        // CCCD written, update notification state
        if (p_beep->evt_handler != NULL)
        {
            ble_beep_evt_t evt;

            if (ble_srv_is_notification_enabled(p_evt_write->data))
            {
                evt.evt_type = BLE_beep_EVT_NOTIFICATION_ENABLED;
            }
            else
            {
                evt.evt_type = BLE_beep_EVT_NOTIFICATION_DISABLED;
            }

            p_beep->evt_handler(p_beep, &evt);
        }
    }
}


/**@brief Function for handling the Write event.
 *
 * @param[in]   p_beep      Cycling Speed and Cadence Service structure.
 * @param[in]   p_ble_evt   Event received from the BLE stack.
 */
static void on_write(ble_beep_t * p_beep, ble_evt_t const * p_ble_evt)
{
    ble_gatts_evt_write_t const * p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;

    if ((p_evt_write->handle == p_beep->tx_handles.cccd_handle) && (p_evt_write->len == 2))
    {
        p_beep->isTX_notification_enabled = ble_srv_is_notification_enabled(p_evt_write->data);
        #if BLE_BUS_LOG_ENABLED
            NRF_LOG_INFO("TX notification: %s, change Err: 0x%04X/%u", (p_beep->isTX_notification_enabled) ? "On" : "Off");
        #endif

        // On TX notification change
        p_beep->txEventHandler((p_beep->isTX_notification_enabled) ? APP_FLASH_COMM_STARTED : APP_FLASH_COMM_STOPPED, NULL);
    }
    else if ((p_evt_write->handle == p_beep->control_char.cccd_handle) && (p_evt_write->len == 2))
    {
        p_beep->isRX_notification_enabled = ble_srv_is_indication_enabled(p_evt_write->data);
        #if BLE_BUS_LOG_ENABLED
            NRF_LOG_INFO("RX notification: %s", (p_beep->isRX_notification_enabled) ? "On" : "Off");
        #endif
    }
    else
    {
        // Do Nothing. This event is not relevant for this service.
    }
}

/**@brief Authorize WRITE request event handler.
 *
 * @details Handles WRITE events from the BLE stack.
 *
 * @param[in]   p_sc_ctrlpt  SC Ctrlpt structure.
 * @param[in]   p_gatts_evt  GATTS Event received from the BLE stack.
 *
 */
static void on_rw_authorize_request(ble_beep_t * p_beep,  ble_gatts_evt_t const * p_gatts_evt)
{
    ble_gatts_evt_rw_authorize_request_t const * p_auth_req = &p_gatts_evt->params.authorize_request;

    if (p_auth_req->type == BLE_GATTS_AUTHORIZE_TYPE_WRITE)
    {
        if (   (p_gatts_evt->params.authorize_request.request.write.op != BLE_GATTS_OP_PREP_WRITE_REQ)
            && (p_gatts_evt->params.authorize_request.request.write.op != BLE_GATTS_OP_EXEC_WRITE_REQ_NOW)
            && (p_gatts_evt->params.authorize_request.request.write.op != BLE_GATTS_OP_EXEC_WRITE_REQ_CANCEL)
           )
        {
            if (p_auth_req->request.write.handle == p_beep->control_char.value_handle) //  ->sc_ctrlpt_handles.value_handle
            {
                on_ctrlpt_write(p_beep, &p_auth_req->request.write);
            }
        }
    }
}



static void on_hvx_tx_complete(ble_beep_t * p_beep, ble_evt_t const * p_ble_evt)
{
    ret_code_t err_code;
    
    /*
     * Check if the notifications are enabled and if the message lenght is not zero and the message lenght is not zero.
     * Since there's no source indication with the HVX event there's no way to check if the transmission of the flash 
     * data was succesfull without adding another layer of flow control.
     */
    if (p_beep->isTX_notification_enabled && p_beep->txLenght != 0 && p_beep->txMsgLenght != 0)
    {
        // Check whether data has to be transmitted or if the buffer is empty  
        if((p_beep->txOffset < p_beep->txLenght) && (p_beep->txLenght != 0))
        {
            err_code = ble_beep_send_TXdata_fragment(p_beep);
            #if BLE_BUS_LOG_ENABLED
                NRF_LOG_INFO("HVX[%u]_fragment", p_beep->packetCounter);
            #endif
        }
        else
        {
            p_beep->txLenght         = 0;
            p_beep->txMsgLenght      = 0;
            p_beep->txEventHandler(APP_TX_RDY_FLASH, NULL);
        }
    }
}




void ble_beep_on_ble_evt(ble_evt_t const * p_ble_evt, void * p_context)
{
    ble_beep_t * p_beep = (ble_beep_t *)p_context;

    if (p_beep == NULL || p_ble_evt == NULL)
    {
        return;
    }

    #if 0
        NRF_LOG_INFO("EEP BLE evnt=%u", (uint32_t) p_ble_evt->header.evt_id);
    #endif


    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            on_connect(p_beep, p_ble_evt);
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            on_disconnect(p_beep, p_ble_evt);
            break;

        case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
            on_rw_authorize_request(p_beep, &p_ble_evt->evt.gatts_evt);
            break;

