beepnl/beep-base-firmware/Source_V1.5.12/Code/nRF/nRF5_SDK_15.3/components/ble/ble_services/ble_beep/ble_beep.c
        case BLE_GATTS_EVT_WRITE:
            on_write(p_beep, p_ble_evt);
            break;

        case BLE_GATTS_EVT_HVC:
            beep_ctrlpt_send(p_beep);
            break;

        case BLE_GATTS_EVT_HVN_TX_COMPLETE:
            on_hvx_tx_complete(p_beep, p_ble_evt);
            break;

        default:
            // No implementation needed.
            break;
    }
}



static uint32_t ble_beep_tx_char(ble_beep_t * service, ble_beep_init_t const * service_init)
{
   ble_gatts_char_md_t char_md;
    ble_gatts_attr_md_t cccd_md;
    ble_gatts_attr_t    attr_char_value;
    ble_uuid_t          ble_uuid;
    ble_gatts_attr_md_t attr_md;

    memset(&cccd_md, 0, sizeof(cccd_md));

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.write_perm);

    cccd_md.vloc = BLE_GATTS_VLOC_STACK;

    memset(&char_md, 0, sizeof(char_md));

    char_md.char_props.notify = 1;
    char_md.p_char_user_desc  = NULL;
    char_md.p_char_pf         = NULL;
    char_md.p_user_desc_md    = NULL;
    char_md.p_cccd_md         = &cccd_md;
    char_md.p_sccd_md         = NULL;

    ble_uuid.type = service->uuid_type;
    ble_uuid.uuid = BEEP_TX_UUID;

    memset(&attr_md, 0, sizeof(attr_md));

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.write_perm);

    attr_md.vloc    = BLE_GATTS_VLOC_STACK;
    attr_md.rd_auth = 0;
    attr_md.wr_auth = 0;
    attr_md.vlen    = 1;

    memset(&attr_char_value, 0, sizeof(attr_char_value));

    attr_char_value.p_uuid    = &ble_uuid;
    attr_char_value.p_attr_md = &attr_md;
    attr_char_value.init_len  = sizeof(uint8_t);
    attr_char_value.init_offs = 0;
    attr_char_value.max_len   = BLE_NUS_MAX_MSG_LEN;

    return sd_ble_gatts_characteristic_add(service->service_handle, &char_md, &attr_char_value, &service->tx_handles);
}




static uint32_t ble_beep_ds18B20_char(ble_beep_t * service, ble_beep_init_t const * service_init)
{
    uint32_t            err_code;
    ble_gatts_char_md_t char_md;
    ble_gatts_attr_md_t cccd_md;
    ble_gatts_attr_md_t user_desc_md;
    ble_gatts_attr_t    attr_char_value;
    ble_uuid_t          ble_uuid;
    ble_gatts_attr_md_t attr_md;

	if(service == NULL || service_init == NULL)
	{
		return NRF_ERROR_INVALID_PARAM;
	}

    // Add Custom Value characteristic
    memset(&cccd_md, 0, sizeof(cccd_md));

    //  Read  operation on cccd should be possible without authentication.
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.write_perm);
    cccd_md.write_perm	= service_init->security_level.cccd_write_perm;
    cccd_md.vloc		= BLE_GATTS_VLOC_STACK;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&user_desc_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&user_desc_md.write_perm);
    user_desc_md.vloc	= BLE_GATTS_VLOC_STACK;

    memset(&char_md, 0, sizeof(char_md));

    char_md.char_props.read			= 1;
    char_md.char_props.write		= 0;
    char_md.char_props.notify		= 1;
    char_md.p_char_user_desc		= "DS18B20 Temperature";
	char_md.char_user_desc_size		= strlen(char_md.p_char_user_desc);
	char_md.char_user_desc_max_size = char_md.char_user_desc_size;
    char_md.p_char_pf				= NULL;
    char_md.p_user_desc_md			= &user_desc_md;
    char_md.p_cccd_md				= &cccd_md; 
    char_md.p_sccd_md				= NULL;
		
    ble_uuid.type					= service->uuid_type;
    ble_uuid.uuid					= BEEP_DS18B20_UUID;

    memset(&attr_md, 0, sizeof(attr_md));

    attr_md.read_perm				= service_init->security_level.read_perm;
    attr_md.write_perm				= service_init->security_level.write_perm;
    attr_md.vloc					= BLE_GATTS_VLOC_STACK;
    attr_md.rd_auth					= 0;
    attr_md.wr_auth					= 0;
    attr_md.vlen					= 1;

    memset(&attr_char_value, 0, sizeof(attr_char_value));

    attr_char_value.p_uuid			= &ble_uuid;
    attr_char_value.p_attr_md		= &attr_md;
    attr_char_value.init_offs		= 0;
    attr_char_value.max_len			= 20;
    attr_char_value.init_len		= 0;
    attr_char_value.p_value			= NULL;
	
    err_code = sd_ble_gatts_characteristic_add(service->service_handle, &char_md, &attr_char_value, &service->ds18B20_char);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    return NRF_SUCCESS;
}


uint32_t ble_beep_ctrlpt_init(ble_beep_t * p_beep, ble_beep_init_t const * service_init)
{
    if (p_beep == NULL || service_init == NULL)
    {
        return NRF_ERROR_NULL;
    }

    ble_add_char_params_t	add_char_params;  

    // Add Control Point characteristic
    memset(&add_char_params, 0, sizeof(add_char_params));
    add_char_params.uuid					= BEEP_CP_UUID;
    add_char_params.max_len					= BEEP_MAX_LENGHT;
    add_char_params.is_var_len				= true;
    add_char_params.char_props.indicate		= 1;
    add_char_params.char_props.write		= 1;
    add_char_params.cccd_write_access		= SEC_OPEN;
    add_char_params.write_access			= SEC_OPEN;
    add_char_params.is_defered_write		= true;

    return characteristic_add(p_beep->service_handle, &add_char_params, &p_beep->control_char);
}



uint32_t ble_beep_init(ble_beep_t * p_beep, ble_beep_init_t const * p_beep_init)
{
    if (p_beep == NULL || p_beep_init == NULL)
    {
        return NRF_ERROR_NULL;
    }

    uint32_t              err_code;
    ble_uuid_t			  service_uuid;
    ble_add_char_params_t add_char_params;
    

    // Initialize service structure
    p_beep->evt_handler		= p_beep_init->evt_handler;
    p_beep->conn_handle		= BLE_CONN_HANDLE_INVALID;
    p_beep->txEventHandler  = p_beep_init->txCallback;
    p_beep->callback_p      = p_beep_init->callback_p;

    // Add service UUID to the database
	ble_uuid128_t beep_uuid = BEEP_SERVICE_UUID_BASE;
	err_code				= sd_ble_uuid_vs_add(&beep_uuid, &p_beep->uuid_type);
    service_uuid.type		= p_beep->uuid_type;
    service_uuid.uuid		= BEEP_SERVICE_UUID;

    err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY, &service_uuid, &p_beep->service_handle);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

	// Data characteristic DS18B20
	err_code = ble_beep_ds18B20_char(p_beep, p_beep_init);
	if(err_code != NRF_SUCCESS)
	{
		return err_code;
	}

    // Add TX characteristic
    err_code = ble_beep_tx_char(p_beep, p_beep_init);
    if(err_code != NRF_SUCCESS)
	{
		return err_code;
	}

	// Add control point characteristic
    err_code = ble_beep_ctrlpt_init(p_beep, p_beep_init);
	if(err_code != NRF_SUCCESS)
	{
		return err_code;
	}

    return NRF_SUCCESS;
}


