beepnl/beep-base-firmware/Source_V1.5.12/Code/nRF/nRF5_SDK_15.3/components/ble/ble_services/ble_beep/ble_beep.c
static bool ble_beep_measurment_encode(ble_beep_t * p_beep, uint16_t * handle, MEASUREMENT_RESULT_s * const measurement, uint8_t * data, uint16_t * lenght)
{
	uint16_t len = 0, offset = 0;;


	if(p_beep == NULL || handle == NULL || measurement == NULL || data == NULL || lenght == NULL)
	{
		return NRF_ERROR_NULL;
	}


	// Depending on the measurement type encode the data differently.
	switch(measurement->type)
	{
		//------------------------------------------------------------------------------------------------------------------
		case DS18B20:
		{
			uint8_t i;
			DS18B20_RESULTS_s * ds = &measurement->result.ds18B20;

			if(ds->devices == 0)
			{
				return NRF_ERROR_INVALID_LENGTH;
			}

			if(ds->devices > MAX_TEMP_SENSORS)
			{
				ds->devices = MAX_TEMP_SENSORS;
			}
			data[offset] = ds->devices;

			offset = 1;
			for(i = 0; i < ds->devices; i++)
			{
				offset += uint16_big_encode((uint16_t)ds->temperatures[i], &data[offset]);
			}
			*handle = p_beep->ds18B20_char.value_handle;
			*lenght = offset;
			break;
		}

        //------------------------------------------------------------------------------------------------------------------
		case BME280:
		case HX711:
		case AUDIO_ADC:
		case nRF_ADC:
		
        //------------------------------------------------------------------------------------------------------------------
		default:
			*handle = NULL;
			*lenght = 0;
			return NRF_ERROR_INVALID_STATE;
			break;
	
	}

	return NRF_SUCCESS;
}


/*@Brief: Function to encode and add the message to the response queue
*/
uint32_t ble_beep_controlPoint_addQueue(ble_beep_t * p_beep, BEEP_protocol_s * prot)
{
	uint32_t err_code;
    static uint32_t no_mem_count = 0;

    if (p_beep == NULL || prot == NULL)
    {
        return NRF_ERROR_NULL;
    }

    beepQue_s add;
    memset(&add, 0, sizeof(beepQue_s));

    err_code = beep_protocol_encode(true, prot, add.buff, &add.lenght, BEEP_MAX_LENGHT);
    if(err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    // Add the buffer to the queue
	err_code = nrf_queue_push(&beep_queue, &add);
	if(err_code != NRF_SUCCESS)
	{
		NRF_LOG_INFO("Beep queue no mem: %u", no_mem_count++);
	}
	return err_code;
}


uint32_t ble_beep_controlPoint_send(ble_beep_t * p_beep, BEEP_protocol_s * prot)
{
	uint32_t err_code;

    if (p_beep == NULL || prot == NULL)
    {
        return NRF_ERROR_NULL;
    }

    err_code = ble_beep_controlPoint_addQueue(p_beep, prot);
	err_code = beep_ctrlpt_send(p_beep);

	return err_code;
}





uint32_t ble_beep_measurement_send(ble_beep_t * p_beep, MEASUREMENT_RESULT_s * measurement)
{
    if (p_beep == NULL || measurement == NULL)
    {
        return NRF_ERROR_NULL;
    }

    uint32_t				err_code;
	uint8_t					encoded_meas[BEEP_MAX_LENGHT];
	uint16_t				len;
	uint16_t				hvx_len;
	ble_gatts_hvx_params_t	hvx_params;

	err_code = ble_beep_measurment_encode(p_beep, &hvx_params.handle, measurement, encoded_meas, &len);
	if(err_code != NRF_SUCCESS)
	{
		return err_code;
	}

	// Send value if connected and notifying, otherwise update the value in the BLE stack.
	if (p_beep->conn_handle != BLE_CONN_HANDLE_INVALID)
	{
		hvx_len = len;
		hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;
		hvx_params.offset = 0;
		hvx_params.p_len  = &hvx_len;
		hvx_params.p_data = encoded_meas;

		err_code = sd_ble_gatts_hvx(p_beep->conn_handle, &hvx_params);
		if ((err_code == NRF_SUCCESS) && (hvx_len != len))
		{
			err_code = NRF_ERROR_DATA_SIZE;
		}
	}
	else
	{
		ble_gatts_value_t gatts_value;
		gatts_value.len		= len;
		gatts_value.offset	= 0;
		gatts_value.p_value	= encoded_meas;
		sd_ble_gatts_value_set(BLE_CONN_HANDLE_INVALID, hvx_params.handle, &gatts_value);
	}

    return err_code;
}



uint32_t ble_beep_TXdata_send(ble_beep_t * p_nus, uint8_t * p_data, uint16_t length)
{
    ret_code_t err_code;

    VERIFY_PARAM_NOT_NULL(p_nus);
    VERIFY_PARAM_NOT_NULL(p_data);

    if (p_nus->conn_handle == BLE_CONN_HANDLE_INVALID)
    {
        return NRF_ERROR_NOT_FOUND;
    }

    if(length == 0 || p_nus->dataLenghtMax == 0)
    {
        return NRF_ERROR_INVALID_LENGTH;
    }

    p_nus->txData_p         = p_data;
    p_nus->txLenght         = length;
    p_nus->txOffset         = 0;
    return ble_beep_send_TXdata_fragment(p_nus);
}


uint32_t ble_beep_send_TXdata_fragment(ble_beep_t * p_nus)
{
    ret_code_t                  err_code = NRF_SUCCESS;
    ble_gatts_hvx_params_t      hvx_params;
    static uint8_t              msgData [NRF_SDH_BLE_GATT_MAX_MTU_SIZE] = {0};
    static uint16_t             lenght;

    VERIFY_PARAM_NOT_NULL(p_nus);

    while(err_code == NRF_SUCCESS)
    {
        if ((p_nus->conn_handle == BLE_CONN_HANDLE_INVALID))
        {
            return NRF_ERROR_NOT_FOUND;
        }

        if (!p_nus->isTX_notification_enabled)
        {
            return NRF_ERROR_INVALID_STATE;
        }

        if((p_nus->txOffset >= p_nus->txLenght) || (p_nus->txLenght == 0))
        {
            return NRF_ERROR_INVALID_LENGTH;
        }

        p_nus->txMsgLenght = p_nus->txLenght - p_nus->txOffset;
        if(p_nus->txMsgLenght > p_nus->dataLenghtMax)
        {
            p_nus->txMsgLenght = p_nus->dataLenghtMax;
        }

        memset(&hvx_params, 0, sizeof(hvx_params));

        memset(msgData, 0, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
        uint16_big_encode(p_nus->packetCounter, msgData);
        memcpy(&msgData[2], &p_nus->txData_p[p_nus->txOffset], p_nus->txMsgLenght);
    
    
        lenght = p_nus->txMsgLenght + 2;
        hvx_params.handle = p_nus->tx_handles.value_handle;
        hvx_params.p_data = msgData;
        hvx_params.p_len  = &lenght;
        hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;

        err_code = sd_ble_gatts_hvx(p_nus->conn_handle, &hvx_params);
        #if BLE_BUS_LOG_ENABLED
            NRF_LOG_INFO("ble_bus_send_fragment[%u]: len=%u, err: %u", p_nus->packetCounter, lenght, err_code);
        #endif

        if(err_code == NRF_SUCCESS)
        {
            p_nus->packetCounter++;
            p_nus->txOffset += p_nus->txMsgLenght;

            // check if there' still data to be transmitted.
            if(p_nus->txOffset >= p_nus->txLenght)
            {
                NRF_LOG_INFO("Done!");
                return err_code;
            }
        }
    }

    #if 0
        NRF_LOG_INFO("Escape!");
    #endif
    return err_code;
}




